Revit 2027 API
ElementDesignOptionFilter(ElementId, Boolean) Constructor
 Constructs a new instance of a filter to match elements contained within a particular design option, with the option to invert the filter and find elements not contained within a particular design option.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementDesignOptionFilter(
	ElementId designOptionId,
	bool inverted
)
Public Sub New (
	designOptionId As ElementId,
	inverted As Boolean
)
public:
ElementDesignOptionFilter(
	ElementId^ designOptionId,
	bool inverted
)
new :
        designOptionId : ElementId *
        inverted : bool -> ElementDesignOptionFilter
Parameters
designOptionId ElementId
 The design option id to match.
inverted Boolean
 True if the filter should match all elements which are not contained within a particular design option.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementDesignOptionFilter Class
ElementDesignOptionFilter Overload
Autodesk.Revit.DB Namespace